<?
require_once("modules/head.php");
printhead();?>
	<body>
		<div class="wrapper">
				<div class="top">
					<?printmenu();?>
				</div>
				<div class="middle between">
					<span>Образовательный ресурс<br>по дисциплине</span>
					<h1>Разработка и эксплуатация удаленных баз данных</h1>
				</div>
				<div class="bottom">
					<p>Если вы хотите узнать, как получить информацию из базы данных, но не знаете, с чего начать, то этот ресурс для вас. Если же вы знакомы с языком SQL или даже являетесь специалистом по базам данных, то вам будет интересно оценить свои знания.</p>

<p>Цель этого ресурса — быстрое изучение языка SQL. При этом «быстрое» вовсе не означает «поверхностное». Напротив, оставляя в стороне многие аспекты языка, автор старается дать глубокое понимание логической структуры данных и, как следствие, правильного построения запросов с учетом этой структуры.

<p>С помощью данного ресурса вы сможете не только улучшить свои знания языка SQL, но и закрепить их практически.Мы надеемся, что сайт окажется полезным как новичкам, так и профессионалам в SQL. Запросы в образовательном ресурсе выполняются реальной СУБД. Пока это MySQL, но мы планируем возможность использования также и других серверов баз данных, начиная со свободно распространяемых и заканчивая коммерческими продуктами: </p>
<p>MS SQL Server <br>
PostgreSQL <br>
Oracle <br>
... <br>
чтобы можно было изучать особенности диалектов языка SQL у разных СУБД.</p>
				</div>
				<?printfooter();?>
			</div>
		</div>
	</body>
</html>

